In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv('titanic.csv')

In [3]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
df_rich = titanic[titanic.Pclass == 1]

In [6]:
df_rich

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [7]:
pd.crosstab(df_rich.Sex,df_rich.Survived)

Survived   0   1
Sex
female     3  91
male      77  45

### Servived and Gender

In [8]:
pd.crosstab(titanic.Survived,titanic.Sex)

Sex       female  male
Survived
0             81   468
1            233   109

#### Total Survived passanger is(233+109)= 342

#### Total Not-survived passanger is (81+468)= 549

In [9]:
 (81/(81+468))*100 # around 15% female not survived out of not survived passangers

14.754098360655737

In [10]:
(468/(81+468))*100 # around 85% male not survived out of not survived passangers

85.24590163934425

In [11]:
(81/(81+233))*100 # around 26% female not survived

25.796178343949045

In [12]:
(233/(81+233))*100 # around 74% female survived

74.20382165605095

In [13]:
(468/(468+109))*100 # around 81% male not survived

81.10918544194108

In [14]:
(109/(468+109))*100 # around 19% male survived

18.890814558058924

______________________________________________________________________________________

### Servived and Pclass(Passanger Class)

In [15]:
pd.crosstab(titanic.Survived,titanic.Pclass,margins=True)

Pclass      1    2    3  All
Survived
0          80   97  372  549
1         136   87  119  342
All       216  184  491  891

In [16]:
(372/(80+97+372))*100  # around 68% of passangers Death from class3 out of death passangers

67.75956284153006

In [17]:
(97/(80+97+372))*100  # around 18% of passangers Death from class2 out of death passangers

17.66848816029144

In [18]:
(80/(80+97+372))*100# around 15% of passangers Death from class1 out of death passangers

14.571948998178508

In [19]:
(491/891)*100 # More than 50% passangers was traveling from class 3

55.106621773288445

In [20]:
(372/(372+119))*100 # near about 76% passengers death from class3

75.76374745417516

In [21]:
(97/(97+87))*100 ## near about 53% passangers death from class2

52.71739130434783

In [22]:
(80/(80+136))*100    # 37% passengers death from class 1

37.03703703703704

 _______________________________________________________________________________________________________________

### Survived and Fare

In [23]:
pd.crosstab(titanic.Fare,titanic.Survived)

Survived   0  1
Fare
0.0000    14  1
4.0125     1  0
5.0000     1  0
6.2375     1  0
6.4375     1  0
...       .. ..
227.5250   1  3
247.5208   1  1
262.3750   0  2
263.0000   2  2
512.3292   0  3

[248 rows x 2 columns]

### Survived and Sibsp(Number of Siblings/Spouses Aboard)

In [24]:
pd.crosstab(titanic.Survived,titanic.SibSp)

SibSp       0    1   2   3   4  5  8
Survived
0         398   97  15  12  15  5  7
1         210  112  13   4   3  0  0

In [25]:
398+210  # 608 passangers had 0 siblings

608

In [26]:
97+112 # 209 passangers had 1 siblings

209

In [27]:
15+13 # 28 passangers had 18 siblings so on

28

In [28]:
398/(398+97+15)

0.7803921568627451

### Survived and Embarked

##### Port of Embarkation (C = Cherbourg; Q = Queenstown; S = Southampton)

In [29]:
pd.crosstab(titanic.Survived,titanic.Embarked)

Embarked   C   Q    S
Survived
0         75  47  427
1         93  30  217

In [30]:
(217/(217+427))*100 # aroun 34% passangers  survived which was embarked at Southampton

33.69565217391305

In [31]:
(30/(30+47))*100 # around 39% passangers survived which was embarked at Queenstown

38.961038961038966